#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
random_string.suffix: Refreshing state... [id=6kQEtLTZ]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-070aa441b51717e3e]
module.eks.aws_iam_policy.cluster_elb_sl_role_creation[0]: Refreshing state... [id=arn:aws:iam::984102645395:policy/education-eks-6kQEtLTZ-elb-sl-role-creation20210318150218841900000001]
module.eks.aws_iam_role.cluster[0]: Refreshing state... [id=education-eks-6kQEtLTZ20210318150218863100000002]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-07ce38bd032b869cd]
module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSVPCResourceControllerPolicy[0]: Refreshing state... [id=education-eks-6kQEtLTZ20210318150218863100000002-20210318150219331300000005]
module.eks.aws_iam_role_policy_attachment.cluster_elb_sl_role_creation[0]: Refreshing state... [id=education-eks-6kQEtLTZ20210318150218863100000002-20210318150219345300000006]
module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSServicePolicy[0]: Refreshing state... [id=education-eks-6kQEtLTZ20210318150218863100000002-20210318150219324800000003]
module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSClusterPolicy[0]: Refreshing state... [id=education-eks-6kQEtLTZ20210318150218863100000002-20210318150219326900000004]
aws_security_group.worker_group_mgmt_two: Refreshing state... [id=sg-07d1c7bc32c58a9ad]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-02662f26823075e4f]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-08edfc2e93f4c5ede]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-086192360f915c656]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-03182dd77506dab15]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-0f1db1e669bd6ea34]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-019337dfd58983de8]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-080e27ec3e9df44dc]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-008d01deb24fe1f55]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-04d4f2c81df1b56ba]
aws_security_group.all_worker_mgmt: Refreshing state... [id=sg-0f373a275939a9982]
aws_security_group.worker_group_mgmt_one: Refreshing state... [id=sg-0d431ea1075844e92]
module.eks.aws_security_group.workers[0]: Refreshing state... [id=sg-0a61d341a975f5d0b]
module.eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-0b0fe22ee420c7cd1]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-02662f26823075e4f1080289494]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-017941efb71d20b9f]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0941a5b3552a3fc3f]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-07081fbcde2a9a1b1]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-06fb23035932935c7]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-04e9937f0b7631e5e]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0314df0d0f7d56b36]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0833634de0291f557]
module.eks.aws_security_group_rule.cluster_egress_internet[0]: Refreshing state... [id=sgrule-3587531613]
module.eks.aws_security_group_rule.workers_ingress_self[0]: Refreshing state... [id=sgrule-2961444304]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-08edfc2e93f4c5ede1080289494]
module.eks.aws_security_group_rule.workers_ingress_cluster_https[0]: Refreshing state... [id=sgrule-4117964445]
module.eks.aws_security_group_rule.workers_ingress_cluster[0]: Refreshing state... [id=sgrule-985812880]
module.eks.aws_security_group_rule.cluster_https_worker_ingress[0]: Refreshing state... [id=sgrule-176163345]
module.eks.aws_security_group_rule.workers_egress_internet[0]: Refreshing state... [id=sgrule-1053951328]
module.eks.aws_eks_cluster.this[0]: Refreshing state... [id=education-eks-6kQEtLTZ]
module.eks.aws_iam_role.workers[0]: Refreshing state... [id=education-eks-6kQEtLTZ2021031815122733450000000c]
module.eks.null_resource.wait_for_cluster[0]: Refreshing state... [id=4032723415137773119]
module.eks.local_file.kubeconfig[0]: Refreshing state... [id=abf85fd1c8ba716f2d8dd4573245f82e1c7a8798]
module.eks.aws_iam_role_policy_attachment.workers_AmazonEKSWorkerNodePolicy[0]: Refreshing state... [id=education-eks-6kQEtLTZ2021031815122733450000000c-2021031815122800910000000f]
module.eks.aws_iam_role_policy_attachment.workers_AmazonEKS_CNI_Policy[0]: Refreshing state... [id=education-eks-6kQEtLTZ2021031815122733450000000c-20210318151228054500000011]
module.eks.aws_iam_instance_profile.workers[1]: Refreshing state... [id=education-eks-6kQEtLTZ2021031815122787060000000e]
module.eks.aws_iam_instance_profile.workers[0]: Refreshing state... [id=education-eks-6kQEtLTZ2021031815122786950000000d]
module.eks.aws_iam_role_policy_attachment.workers_AmazonEC2ContainerRegistryReadOnly[0]: Refreshing state... [id=education-eks-6kQEtLTZ2021031815122733450000000c-20210318151228011600000010]
module.eks.aws_launch_configuration.workers[0]: Refreshing state... [id=education-eks-6kQEtLTZ-worker-group-120210318183209506300000001]
module.eks.aws_launch_configuration.workers[1]: Refreshing state... [id=education-eks-6kQEtLTZ-worker-group-220210318183209522400000002]
module.eks.random_pet.workers[1]: Refreshing state... [id=fluent-stud]
module.eks.random_pet.workers[0]: Refreshing state... [id=optimal-ray]
module.eks.aws_autoscaling_group.workers[1]: Refreshing state... [id=education-eks-6kQEtLTZ-worker-group-220210318183210106300000004]
module.eks.aws_autoscaling_group.workers[0]: Refreshing state... [id=education-eks-6kQEtLTZ-worker-group-120210318183210093700000003]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.eks.kubernetes_config_map.aws_auth[0] will be created
  + resource "kubernetes_config_map" "aws_auth" {
      + data = {
          + "mapAccounts" = jsonencode([])
          + "mapRoles"    = <<-EOT
                - "groups":
                  - "system:bootstrappers"
                  - "system:nodes"
                  "rolearn": "arn:aws:iam::984102645395:role/education-eks-6kQEtLTZ2021031815122733450000000c"
                  "username": "system:node:{{EC2PrivateDNSName}}"
            EOT
          + "mapUsers"    = jsonencode([])
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "app.kubernetes.io/managed-by" = "Terraform"
              + "terraform.io/module"          = "terraform-aws-modules.eks.aws"
            }
          + name             = "aws-auth"
          + namespace        = "kube-system"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.eks.local_file.kubeconfig[0] will be created
  + resource "local_file" "kubeconfig" {
      + content              = <<-EOT
            apiVersion: v1
            preferences: {}
            kind: Config
            
            clusters:
            - cluster:
                server: https://A9A9C165A19555414F6FAF040EFF498B.sk1.us-east-2.eks.amazonaws.com
                certificate-authority-data: LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUN5RENDQWJDZ0F3SUJBZ0lCQURBTkJna3Foa2lHOXcwQkFRc0ZBREFWTVJNd0VRWURWUVFERXdwcmRXSmwKY201bGRHVnpNQjRYRFRJeE1ETXhPREUxTURneE9Wb1hEVE14TURNeE5qRTFNRGd4T1Zvd0ZURVRNQkVHQTFVRQpBeE1LYTNWaVpYSnVaWFJsY3pDQ0FTSXdEUVlKS29aSWh2Y05BUUVCQlFBRGdnRVBBRENDQVFvQ2dnRUJBTkNqCk9KeWo5Skl4emNBamNSVzFwamFVT3pKREFObnFZQkN0SXlhV3M4RDZBek0zZVhCS2dJakR2Q3ovbEo2azVlQlYKTGYwYjZSSmVISm1tMzM5VWlxYjdVaEo5U2lnNzZhbEg1eWNkY25RSGp0QVN5TWw4MXljemFPZUJkSzJuWTZNZApCMGdBMEV0aUVEYkhhZU9kR1Q1Zms5L2VWZklRVFd3U3ZTY25LeHJ6SGF5T0k3U1NuaXVsTHpoZnREK0ZGczBJClQxRkZGbzk5cnYzSzhpUnNuaUZETXl0elNtSXl6LzJQQ0o1Q29yRm1kVzQvU280Y0RvN2drU2RIeFVUNzdrb2MKWkVadnUvWFR2cnIxbWRVQWNmNzBEWWtvSDlJMXhEa3NFNFVKV1ZycFUwaTl3VlkxbHdrRnlQRlFMRE9oU1pELwpzSUlscG11M1RweXdWTDZqUVVrQ0F3RUFBYU1qTUNFd0RnWURWUjBQQVFIL0JBUURBZ0trTUE4R0ExVWRFd0VCCi93UUZNQU1CQWY4d0RRWUpLb1pJaHZjTkFRRUxCUUFEZ2dFQkFBczBtMFpNcVFyb25DbG1COWp0V2VzazFTUjMKK3J5K3VqSkRZbnJRdGhJQy9SVVFEZHUybCtlL2tLU2NlMGRaVS9VTG4zK1Q3VU1LRVg1WW9EK0s2UHFKWmRIQQpreVJ6bVZId3VHTW9LNVl1K2UwRTQ0NzFiamUvVUE4a1RucjZpcmVlVVZhVWZITGEyUUg1Ty80QjhsamlWaXpqCmM4ZzJsYy9ldUJDU2lORjVqUVBHTUoyNHd2Q0VqM08rVnRCVzluZkhTbFZJN0JjaUVyNjhOYThGVHpZVEhGalQKQ3RVL0JWSHBWam9aUFZxQ0JwUCtkYVorVFVPcUZ6TWc3ZEp4ZHZHd1NvTHA1dlNtMGJFeVJrOTY3aGJNUFp0WgozTjVUQURpckVPTHpMS2ZPdWw4R1lDRUVyR0VaS3hSczhDSWlHM1o5OUVvQ2lTV2MxKytOL1JmVVFlTT0KLS0tLS1FTkQgQ0VSVElGSUNBVEUtLS0tLQo=
              name: eks_education-eks-6kQEtLTZ
            
            contexts:
            - context:
                cluster: eks_education-eks-6kQEtLTZ
                user: eks_education-eks-6kQEtLTZ
              name: eks_education-eks-6kQEtLTZ
            
            current-context: eks_education-eks-6kQEtLTZ
            
            users:
            - name: eks_education-eks-6kQEtLTZ
              user:
                exec:
                  apiVersion: client.authentication.k8s.io/v1alpha1
                  command: aws-iam-authenticator
                  args:
                    - "token"
                    - "-i"
                    - "education-eks-6kQEtLTZ"
        EOT
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "./kubeconfig_education-eks-6kQEtLTZ"
      + id                   = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + config_map_aws_auth = [
      + {
          + binary_data = null
          + data        = {
              + "mapAccounts" = jsonencode([])
              + "mapRoles"    = <<-EOT
                    - "groups":
                      - "system:bootstrappers"
                      - "system:nodes"
                      "rolearn": "arn:aws:iam::984102645395:role/education-eks-6kQEtLTZ2021031815122733450000000c"
                      "username": "system:node:{{EC2PrivateDNSName}}"
                EOT
              + "mapUsers"    = jsonencode([])
            }
          + id          = (known after apply)
          + metadata    = [
              + {
                  + annotations      = null
                  + generate_name    = null
                  + generation       = (known after apply)
                  + labels           = {
                      + "app.kubernetes.io/managed-by" = "Terraform"
                      + "terraform.io/module"          = "terraform-aws-modules.eks.aws"
                    }
                  + name             = "aws-auth"
                  + namespace        = "kube-system"
                  + resource_version = (known after apply)
                  + self_link        = (known after apply)
                  + uid              = (known after apply)
                },
            ]
        },
    ]

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

```

</details>

*Pusher: @jonathanbaraldi, Action: `pull_request`*